---
title: Sensitive File Read - /etc/shadow
id: a1b2c3d4-e5f6-7890-abcd-ef1234567890
status: experimental
description: Detects a process reading /etc/shadow via openat syscall
author: you
date: 2025-01-01
tags:
  - attack.credential_access
  - attack.t1003
logsource:
  product: linux
  service: syslog
detection:
  selection:
    output_fields.fd.name: '/etc/shadow'
    output_fields.evt.type: 'openat'
  condition: selection
level: high
#test8